//Домашка
//Задача №1
//Яка довжина масиву
/* 
let arr = ['Ваня', 'Іван', 'Оля'];

let newArr = arr;
newArr.push('Petia');
console.log(arr.length); //4

//Задача №2
-Створіть масив users з елементами 'Ваня' і 'Іван'. 
-Додайте елемент 'Оля' в кінці. 
-Замініть значення 'Іван'на 'Петя'.
-Код для пошуку має працювати з масивами будь якої довжини .
-Видаліть перший елемент масиву і покажіть його .
-Вставет "Маша" і "Паша" на поічаток масиву
 */
/* 
let arr = ['Ваня', 'Іван'];
arr.push('Оля'); 
arr[1] = 'Петя';
let del = arr.shift();
console.log(del); //Ваня
arr.unshift('Маша', 'Паша');
console.log(arr); //  ["Маша", "Паша", "Петя", "Оля"] */


//Задача №3
