//
/* Просимо користувача ввести суму його зарплати.Потім розраховуємо:
-Добавку в вигляді премії в суммі 15% від зарплати
-Налоги в суммі 10% від сумми всіх нарахувань(зп+премія)
-Витрати в магазині в суммі 190
-Розділяємо залишок між користувачем і його дружиною
При вирішенні використовуйте арифметичні оператори присвоєння, наприклад res -=100 або res /=2  де res - це змінна, в яку записуються всі дії по розрахунку суми.
Введіть скільки залишилось в результаті всіх операцій грошей у користувача */

//