// АНОНІМНІ Ф-ЦІЇ
//Приклад стандартної ф-ції
function powerOfTwo(num){
  return num * num;
}
console.log(powerOfTwo(5));

//Тепер ф-ція анонімна, тому що в неї немає назви. Вона має бути покладенна в змінну щоб її можна було використовувати
let poft = function (num){
  return num * num;
}
// poft тепер константа ф-ції яку ми викликаємо
console.log(poft(6));

/* Ф-ціями можна оперувати як змінними:класти ф-цію як аргумент іншої ф-ції; із ф-ції повертати іншу ф-цію

Відміність в тому, що звичайну ф-цію можна викликати, а потім оголосити і це не буде помилкою. З змінними все інакше, їх треба спочатку оголошувати, а потім викликати */