// АНОНІМНІ Ф-ЦІЇ АБО Ф-ЦІОНАЛЬНІ ВИРАЗИ
/* СИНТАКСИС:
let ім'я змінної = function (параметр, ..., параметр) {
    return вираз;
}; 
Даний синтаксис дає змогу створювати ф-цію в середині будь-якого виразу.
Ф-ція створюється і негайно викликається, або заплановується для подальшого виконання, нігде не зберігається і таким чином стає анонімною.
Ф-ціональний вираз створюється тоді коли до нього доходить виконання, а потім вже використовується.
*/

//Приклад стандартної ф-ції
function powerOfTwo(num){
  return num * num;
}
console.log(powerOfTwo(5));

//Тепер ф-ція анонімна, тому що в неї немає назви. Вона має бути покладенна в змінну щоб її можна було використовувати
let poft = function (num){
  return num * num;
}; // В кінці обов'язково потрбно поставити ';' так як ф-ція створюється всередині виразу присвоєння.
// poft тепер константа ф-ції яку ми викликаємо
 console.log(poft(6)); //Можна викликати щє ось так:poft();

/* Ф-ціями можна оперувати як змінними:класти ф-цію як аргумент іншої ф-ції; із ф-ції повертати іншу ф-цію

Відміність в тому, що звичайну ф-цію можна викликати, а потім оголосити і це не буде помилкою. З змінними все інакше, їх треба спочатку оголошувати, а потім викликати */

// В змінну можна скапіювати і раніше оголошену ф-цію. Після чього ф-цію можна викликати як по її назві так і по назві змінної.
function getSumm(){
  let summ = 1+2;
  console.log(summ);
}
let someVar = getSumm; //В момент копіювання ф-ція не виконується так як немає (). Якби вони були, то вираз someVar = getSumm записав би результат виклику getSumm в змінну, а не саму ф-цію.

someVar();
getSumm();

//
// Ф-ція об'явлена в блоці не викликається за його межами
if(2 > 1) {
  function getSumm() {
    let summ = 1 + 2;
    console.log(summ);
  }
}
getSumm();

// Ф-ціональний вираз вирішує цю проблему
let getSumm;
if(2 > 1) {
getSumm = function () {
    let summ = 1 + 2 ;
    console.log(summ);
  }
}
getSumm();

//
//Оголошення ф-ції видно тільки в межах блоку.
let age = prompt("Скільки вам років?");
let welcome;

if (age <18){

    welcome = function () {
        console.log("Привіт!");
    };
}else {
    welcome = function () {
        console.log("Доброго дня!");  
    };
}

welcome ();

//
//Даний приклад можна упростити використавуючи оператор ?
age = prompt("Скільки вам років?");

welcome = (age < 18) ?
    function () { console.log("Привіт!"); } :
    function () { console.log("Доброго дня!"); };

welcome ();