/* 
Вбудований об'єкт, який зберішає в своїх властивостях і методах різноманітні математичні константи і -ції. Не працює з числоами типу BigInt.
Не являється конструктором , всі властивості і методи статистичні.
Методи:
-Math.max([x[, y[, …]]]) - повертає найбільше число із своїх аргументів
-Math.min([x[, y[, …]]]) - повертає найменше число
-Math.pow(a, n) - повертає a в n-й ступені.
-Math.random() - повертає випадкове число в діапазоні від 0 до 1
-Math.round(x) - повертає значення число, округлене до найближчого цілого

*/