//Інші методи створення масивів
/* Вони підходять якщо потрібно передстворити масив і
 передзаповнити якимись даними, можливо по якійсь логіці, 
 для подальшого використання.
 Якщо масив прийшов ззовні, дані методи працювати не будуть,
 але якщо ми самі створюємо масив, то щоб не заповнювати його
 самостійно вручну(наприклад числами від  1 до 100), це може 
 зробити JS за допомогою певних методів.
 */

 //new Array
//Можна передавати елементи або довжину масиву
console.log(new Array(1, 2, 3, 4, 5)); //(5) [1, 2, 3, 4, 5]
/* Даний синтаксис оголошення використовується рідко, але він 
використовується часто тоді коли потрібно створити порожній 
масив певної довжини */

//Передаємо довжину масиву
const arr2 = new Array(5);
console.log(arr2);//(5) [empty × 5]
//Утвориться масив із 5 порожніми елементами, з якими не можна 
//взаємодіяти за допомогою map
console.log(arr2.map(el => el + 1)); //(5) [empty × 5]
/* Нічього не відбулося, тому щоб взаємодіяти з map, потрібно
масив чимось заповнити, для цього існує спеціалізований
метод FILL .

// МЕТОД FILL
Беремо масив, викликаємо до нього метод fill і передаємо
значення */
arr2.fill(1); 
console.log(arr2); //(5) [1, 1, 1, 1, 1]
//Можна заповнити масив в певних позиціях
arr2.fill(1, 0, 3);//(5) [1, 1, 1, empty × 2]
/*  Перші три позиції заповняться одним значенням, а 4-5
залишаться порожніми */ 
arr2.fill(2, 3, 5); // Заповнюємо порожні слоти двійками з 3 по 5 позиції
console.log(arr2);  //[1, 1, 1, 2, 2]

//
// МЕТОД ARRAY.FROM
/* Передає в () те як буде відбуватись ітерація по масиву.
Першим елементом використовується об'єкт, який передає довжину 
масиву. Далі іде стрілкова ф-ція,яка модифікує масив по певній 
логікі(наприклад по індексу), вказуючи як ми хочемо заповнити 
порожній об'єкт і чим
*/
const arr3 = Array.from({length: 5}, () => 5);
console.log(arr3); //[5, 5, 5, 5, 5]
/* Це рівносильно створенню порожнього масиву методом 
new Array і заповнення fill пятірками.

 Array.from - приймає першим значенням опції створення масиву
 і ф-цію - яка модифікує кожен із цих елементів і щось 
 туди кладе
 */
 const arr4 = Array.from({length: 5}, (cur, i) => i + 1);
 console.log(arr4); //[1, 2, 3, 4, 5]
 /* cur - елемент;  i - індекс
 Фактично це звичайна ф-ція map, тільки тут можна працювати з 
 вихідним масивом, який тільки що створили і вже в ньому 
 робити map.
 (cur, i) => i + 1 - індекс кожного елементу збільшується на 1
 Альтернативний метод:
 Створення порожнього масиву за допомогою new Array, 
 заповнити його значеннями , наприклад undefined і після цього 
 пройтись по ньому map і заповнити його.
 Array.from - більш коротший метод, який дозволяє із більш
 обширних речей створювати масив
  */
