//Перебір елементів 
// Метод forEach - виконує ф-цію для кожного елемента масиву
/* Синтаксис:
arr.forEach(function(item, index, array){
  //робить щось з item
}); */

let arr = ['Ваня', 'Іван', 'Оля'];

//В тілі ф-ції з аргументами можна робити що завгодно, виконувати певні дії, виводити на екран або працювати з ними
/* arr.forEach(function(item, index, array){
  console.log(`${item} знаходиться на ${index} позиції в ${array}`); 
  // Ваня знаходиться на 0 позиції в Ваня,Іван,Оля
  // Іван знаходиться на 1 позиції в Ваня,Іван,Оля
  // Оля знаходиться на 2 позиції в Ваня,Іван,Оля
});
 */

//Даний запис можна спростити за допомогою стрілкової ф-ції
arr.forEach((item, index, array) => {
   console.log(`${item} знаходиться на ${index} позиції в ${array}`);
});

//Також при використання метода forEach можна вказувати просто ім'я окремої ф-ції і все буде працювати точно так

/* arr.forEach(show);

function show (item) {
  console.log(item);
} */

___________________________________________________________________________
//Перебір елементів 
let arr1 = ['Ваня', 'Іван', 'Оля'];
console.log(arr.length); //3

//Цикл FOR
//Можна отримати значення і ключ масиву
//Оголошуємо змінну 'і' яка рівна 0, збільшуємо кожен раз її на одиницю і в якості умови 'і' має бути менше ніж довжина масиву
for (let i = 0; i < arr1.length; i++){
  console.log(arr1[i]); // Якщо потрібно вивести кожне значення масиву, потрібно звернутись до змінної якій присвоєний масив і в [] вказати змінну 'і'
}
//Ключі починаються з 0, перше значення змінної 'і' також 0, і з кожним колом ітерації воно буде збільшуватись на одиницю, поки 'і' не буде рівна length.
//На першому колі 'і' буде рівна 0, відповідно виведеться перше значення масиву. На дркгому колі = 1, друге значення масиву. На третьому колі = 2, третє значення масиву і на четвертому колі 'і' = 3 , умова не спрацює і цикл зупинить свою роботу
___________________________________________________________________________
//Перебір елементів 
//Цикл FOR...OF
//Можна використовувати тільки для виведення значень

let arr2 = ['Ваня', 'Іван', 'Оля'];

//Оголошуємо змінну яка буде мати в собі кожне значення масиву, пишемо of і змінну яка містить в собі масив
for (let arrItem of arr2) {
  console.log(arrItem); //Виводимо в консоль нову створенну змінну, таким чином ми отримуємо значення масиву
}

___________________________________________________________________________
