
//Рендеринг?

/*  
DOM(Document Object Model) - це об'єктне уявлення вихідного HTML-кода документа
Завдяки йому ми можемо звертатись до  HTML елементам в JS

Завдяки DOM ньому існують фреймворки такі як: REACT, ANGULAR, VUE.
І ми можемо вживляти в сторінку необхідні елементи і маніпулювати їх значенням

DOM i API не частини JS, вони вбудовані в браузер і ми взаємодіємо із 
ними безпосередньо із JS

DOM має таку структуру:

Document  - Верхній рівень
HTML
    Head
        Meta(charset...)
        Meta(http...)
        Meta(name...)
        Title           - Text
        Script
    Body  
        Img  

В глобально скоупі є Document і об'єкт Window  
Document там знаходиться для взаємодії з IPA DOM-tree в браузері.
Далі іде корінний HTML елемент який який має мову тегів. Він має два великих вузла: Head і Body

ДЛя того щоб взаємодіяти з HTML-деревом потрібно звертатись до корінного об'єкта Document і від нього вже використовуються різноманітні методи: Вибір по ідентифікатору, класу ...
*/

/* 
При написанні CSS ми можемо вказати якийсь елемент(вибрати) через вказання CSS-селекторів:
-Клас .class
-ID   #id
-ДЛя конкретного елемента , без крапки button
*/


//Вибір елемента по CSS-селектору
//* querySelector - дозволяє вибрати якийсь елемент дерева за допомогою селектора
console.log(document.querySelector());