//BIND(зв'язати)
/* Зв'язує наш this із ф-цією яку ми хочемо викликати
Метод bind() створює нову ф-цію, яка при виклику встановлює в якості контекста виконання this надане значення. В метод також передається набір аргументві, які будуть встановлені перед переданим в прив'язану ф-ції аргументами при її виклику*/

const audi1 = {
  make: 'Audi',
  model: 'A3',
  damages: [],
};
//об'єкт який містить методи маніпуляції з автомобільом
const carManipulation = {
  addDamage (part, rate) {
    this.damages.push({part, rate});
    console.log(`Додати пошкодження на ${this.make} ${this.model}`);
  }
};
//Потрібно ф-цію addDamage викликати на audi. Але ф-ція може викликатись не прямо зараз, тому потрібно створити спеціальну ф-цію яка моглаб маніпулювати  додавання пошкодень саме для цієї audi
//Задача не викликати прямо зараз, а відкласти виклик і зробити зв'язування яке можна зробити за допомогою bind(вказуємо this аргумент)
//Додатково можна вказати і інші аргументи
//На відмінну call i apply непотрібно вказувати додаткові аргументи з якими ми хочемо викликати ф-цію

const addDamageAudi = carManipulation.addDamage.bind(audi1);
//Тепер метод addDamage зв'язаний з об'єктом audi . Коли ми будемо викликати addDamage this буде приймати значення нашого об'єкта
addDamageAudi('Крило', 3); //Додати пошкодження на Audi A3
console.log(audi1); //{make: 'Audi', model: 'A3', damages: {part: 'Крило', rate: 3}}
//По суті коли ми кажемо bind ми зв'язуємо без всякого виклику контекст об'єкту з ф-цією. І тепер addDamageAudi буде викликатись на audi

//Щє одне використання bind яке зустрічається не дуже часто
/* В bind першим аргументом іде контекст, а другим може іти конкретний параметр ф-ції для виклику*/
const addDamageAudiRoof = carManipulation.addDamage.bind(audi1, 'Дах');
addDamageAudiRoof(5); //Додати пошкодження Audi A3
addDamageAudiRoof(4);// цю ф-цію можна викликати скільки завгодно і в неї вже буде зафіксований перший аргумент
console.log(audi1); //{make: 'Audi', model: 'A3', damages: {part: 'Крило', rate: 3}, {part: 'Дах', rate: 5}, {part: 'Дах', rate: 4}}

/* Ми можемо зафіксувати всі аргументи які є в ф-ції і викликати її з фіксованим набором оргументів*/